test/performance/benchmarks/func-invocation-ego-member/run/single-fun-enclave-samba-member-sacmat/1000.log
2025/10/20 05:07:45 Function mode: SINGLE
2025/10/20 05:07:45 RSA_SK is not set, not encrypting using RSA private key
{"level":"info","ts":1760936865.354299,"logger":"fallback","caller":"injection/injection.go:63","msg":"Starting informers..."}
2025/10/20 05:07:45 Starting func invocation probe for target: appender-ego-member
2025/10/20 05:07:45 Using rate: 1000
2025/10/20 05:13:45 Shutting down InfluxReporter
Requests      [total, rate, throughput]         299999, 1000.00, 999.92
Duration      [total, attack, wait]             5m0s, 5m0s, 24.543ms
Latencies     [min, mean, 50, 90, 95, 99, max]  14.583ms, 25.492ms, 22.799ms, 31.84ms, 41.101ms, 72.016ms, 993.352ms
Bytes In      [total, mean]                     343798854, 1146.00
Bytes Out     [total, mean]                     341698861, 1139.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:299999  
Error Set:
2025/10/20 05:13:45 SLA 1 failed. P95 latency is not in 100000000-110000000ms time range: 41.101458ms