test/performance/benchmarks/func-invocation-ego-member/run/single-fun-enclave-samba-member-sacmat/1250.log
2025/10/20 05:15:22 Function mode: SINGLE
2025/10/20 05:15:22 RSA_SK is not set, not encrypting using RSA private key
{"level":"info","ts":1760937322.115561,"logger":"fallback","caller":"injection/injection.go:63","msg":"Starting informers..."}
2025/10/20 05:15:22 Starting func invocation probe for target: appender-ego-member
2025/10/20 05:15:22 Using rate: 1250
Requests      [total, rate, throughput]         374996, 1249.99, 1249.86
Duration      [total, attack, wait]             5m0s, 5m0s, 32.004ms
Latencies     [min, mean, 50, 90, 95, 99, max]  12.675ms, 48.087ms, 29.025ms, 82.192ms, 146.569ms, 387.763ms, 1.931s
Bytes In      [total, mean]                     429745416, 1146.00
Bytes Out     [total, mean]                     427120444, 1139.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:374996  
Error Set:
2025/10/20 05:21:22 Shutting down InfluxReporter
2025/10/20 05:21:22 SLA 1 failed. P95 latency is not in 100000000-110000000ms time range: 146.56876ms