test/performance/benchmarks/func-invocation-ego-member/run/single-fun-enclave-samba-member-sacmat/1500.log
2025/10/20 05:23:19 Function mode: SINGLE
2025/10/20 05:23:19 RSA_SK is not set, not encrypting using RSA private key
{"level":"info","ts":1760937799.8364184,"logger":"fallback","caller":"injection/injection.go:63","msg":"Starting informers..."}
2025/10/20 05:23:19 Starting func invocation probe for target: appender-ego-member
2025/10/20 05:23:19 Using rate: 1500
2025/10/20 05:29:19 Shutting down InfluxReporter
Requests      [total, rate, throughput]         449995, 1500.00, 1499.88
Duration      [total, attack, wait]             5m0s, 5m0s, 20.978ms
Latencies     [min, mean, 50, 90, 95, 99, max]  10.785ms, 109.816ms, 41.243ms, 272.253ms, 558.053ms, 985.897ms, 2.872s
Bytes In      [total, mean]                     515689702, 1145.99
Bytes Out     [total, mean]                     512544305, 1139.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:449991  502:4  
Error Set:
502 Bad Gateway
2025/10/20 05:29:19 SLA 1 failed. P95 latency is not in 100000000-110000000ms time range: 558.052537ms