test/performance/benchmarks/func-invocation-ego-member/run/single-fun-enclave-samba-member-sacmat/250.log
2025/10/20 04:46:13 Function mode: SINGLE
2025/10/20 04:46:13 RSA_SK is not set, not encrypting using RSA private key
{"level":"info","ts":1760935573.187607,"logger":"fallback","caller":"injection/injection.go:63","msg":"Starting informers..."}
2025/10/20 04:46:13 Starting func invocation probe for target: appender-ego-member
2025/10/20 04:46:13 Using rate: 250
Requests      [total, rate, throughput]         75000, 250.00, 249.98
Duration      [total, attack, wait]             5m0s, 5m0s, 26.314ms
Latencies     [min, mean, 50, 90, 95, 99, max]  14.941ms, 30.858ms, 30.544ms, 37.999ms, 39.882ms, 44.709ms, 290.784ms
Bytes In      [total, mean]                     85950000, 1146.00
Bytes Out     [total, mean]                     85425000, 1139.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:75000  
Error Set:
2025/10/20 04:51:13 Shutting down InfluxReporter
2025/10/20 04:51:13 SLA 1 failed. P95 latency is not in 100000000-110000000ms time range: 39.881571ms